#include <iostream>
#include <Windows.h>
#include <fstream>
#include <conio.h>
#include <cstdlib>
#include <ctime>
#include <stdio.h>
using namespace std;
int kv1, kv2, re0, re1, gad, lg, dron, weap, rok, As, gens, bat, kred, bat1, bat2, zpir, pir, bags, sist, tbag, zbag, gal, gal2, gal3, per, bag, pBoss, sch, shit, zad, pop, Boss, boss, dop, dop2, si, Ent, Ent2, tab, Bat, sh, E, rec1, rec2, rec3, Wt, h, o, g, m, r, rr, rrr, x, y, k[5], c[5], f, l, b, z, pz[5], live;
double t, t2;
char tes, u, s, man1[20], man2[20], man3[20];
void Kred();
void ftl();
void kor();
void Kor();
void ast();
void Ast();
void Sist();
void time();//Обьявление всех переменных и функций
int main(){setlocale (LC_ALL, "RUS");
SetConsoleCP(1251);
SetConsoleOutputCP(1251);//Ввод и вывод кирилицы
srand(time(0));//Установка команды на рандомные числа
while (si!= 4){//Ввод начальных параметров коробля игрока и противников (жизни, боезапас, энергия и т.п.)
bags = 10;
zpir = 7;
Bat = 3;
kred = 0;
rok = 0;
gens = 0;
gal = 0;
gal2 = 0;
gal3 = 0;
sist = 1;
shit = 1;
boss = 6;
zbag = 3;
bag = 3;
pir = 3;
Boss = 3;
pBoss = 1;
per = 2;
dop = 0;
Bat = 0;
u = 1;
Ent = 0;
si = 1;
z = 0;
live = 2;
o = -20;
weap = 1;
x=5;
f=3;//Начальная координата коробля, положение астероидов
rr = 0;
c[1] = 0;
c[2] = 0;
c[3] = 0;
c[4] = 0;
k[5] = 0;
k[1] = 0;
k[2] = 0;
k[3] = 0;
k[4] = 0;
while (Ent == 0){//Меню игры, выбор сложности
system("cls");
cout << " Для начала игры выберите уровень, для управления используйте клавиши W, A, S, \n";
cout << " D, для стрельбы и выбора - пробел, для остановки игры нажмите E, для паузы - Q \n";
cout << "                 Стрельба возможна, если у вас есть энергия. \n";
cout << "      Ловите сердечки, чтобы восстановить жизни и аккумуляторы для энергии. \n";
cout << "                                 Приятной игры!!! \n";
cout << " \n";
cout << " \n";
cout << " \n";
cout << "                              Выберите уровень игры: \n";
cout << " \n";
if (u == 1) cout << "                        -->  Выгнали из лётной школы  <-- \n";
else cout << "                             Выгнали из лётной школы \n";
if (u == 2) cout << "                        --> Был за штурвалом и выжил! <-- \n";
else cout << "                            Был за штурвалом и выжил! \n";
if (u == 3) cout << "                        -->         Да я ас!!!        <-- \n";
else cout << "                                    Да я ас!!! \n";
if (u == 4) cout << "                        --> Я Хан, мать его, Соло!!!  <-- \n";
else cout << "                            Я Хан, мать его, Соло!!! \n";
if (u == 5) cout << "                        -->       Выход из игры       <-- \n";
else cout << "                                  Выход из игры \n";
tes = _getch();
if(static_cast<int>(tes) == -10 || static_cast<int>(tes) == 119) u--;
else if(static_cast<int>(tes) == -5 || static_cast<int>(tes) == 115) u++;
else if (static_cast<int>(tes) == -63 || static_cast<int>(tes) == 66){
u = 66;
Ent++;
}
else if(GetAsyncKeyState(VK_SPACE)) Ent++;
if (u == 6) u--;
if (u == 0) u++;
}
system("cls");
if (u != 66 && u != 5){cout << " Добро пожаловать в игру. Вы решили поиграть не в самое счастливое время. Наша \n";//Сюжет
cout << "    голактика подверглась атаке новой рассой. Их коробли представляют собой    \n";
cout << "    ужасающую смесь металла и хитина. Нам не известно, появилась эта расса     \n";
cout << "  естественным путём или была выведена специально. Однако опасность этой рассы \n";
cout << "   беспрецедентна. Вы являетесь пилотом межзвёздного коробля «Стрела». Этот    \n";
cout << "  корабль - творение новейших технологий. Гиперпривод позволяет путешествовать \n";
cout << "  между системами с немыслимой скоростью, а орудия способны прорезать панцирь  \n";
cout << "      противника. Ваша задача - Добраться до матки Жуков и уничтожить её.      \n";
cout << " Это обеспечит безопастность всей голактике. Пройдите пояса астероидов и земли,\n";
cout << "захваченые жуками, но постарайтесь сохранить человечность и не потерять себя в \n";
cout << "                                  пламени войны...                             \n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "      Управление: A - двигать корабль в лево, D - двигать корабль вправо       \n";
cout << "        WASD - перемещение по меню и магазину, ПРОБЕЛ - выбор, выстрел         \n";
cout << "                         Q - пауза, E - выход, С - щит                         \n";
}
switch (u){//Здесь и далее: настройки на разные уровни сложности (Скорость астероидов, количество энергии и т.п.)
case 1: {
E = 10;
t = 1;
t2 = 0.50;
sh = 50;
tab = 1;
ifstream fout("Record1.txt");//Здесь и далее: Выбор файлов для записи рекордов и рекордсменв для разных уровней сложности
fout >> rec1;
fout >> rec2;
fout >> rec3;
fout.close();
ifstream fout2("Mans1.txt");
fout2 >> man1;
fout2 >> man2;
fout2 >> man3;
fout2.close();
_getch();
break;
}
case 2: {
E = 5;
t = 0.50;
t2 = 0.55;
sh = 75;
tab = 2;
ifstream fout("Record2.txt");
fout >> rec1;
fout >> rec2;
fout >> rec3;
fout.close();
ifstream fout2("Mans2.txt");
fout2 >> man1;
fout2 >> man2;
fout2 >> man3;
fout2.close();
_getch();
break;
}
case 3: {
E = 0;
t = 0.50;
t2 = 0.30;
sh = 100;
tab = 3;
ifstream fout("Record3.txt");
fout >> rec1;
fout >> rec2;
fout >> rec3;
fout.close();
ifstream fout2("Mans3.txt");
fout2 >> man1;
fout2 >> man2;
fout2 >> man3;
fout2.close();
_getch();
break;
}
case 4: {
E = -5;
t = 0.40;
t2 = 0.20;
sh = 150;
tab = 4;
ifstream fout("Record4.txt");
fout >> rec1;
fout >> rec2;
fout >> rec3;
fout.close();
ifstream fout2("Mans4.txt");
fout2 >> man1;
fout2 >> man2;
fout2 >> man3;
fout2.close();
_getch();
break;
}
case 66: {
cout << "                  Выбран секретный режим <<I AM BATMAN!!!>> \n";
cout << "              Здравствуйте, милорд. Орудия заряжены до отказа!!! \n";
cout << "                          Разнесите всё к чертям!!! \n";
t = 0.5;
t2 = 0.3;
sh = 10000;
Bat = 1;
_getch();
live = 9;
break;
}
case 5: {return 0;
break;
}
}
system("cls");
cout << "Система Нэва. Это начало вашего пути. Она известна опасным поясом астероидов и \n";//Сюжет
cout << " большой интенсивностью пиратских нападений. Впрочем близость войны, вероятно, \n";
cout << "        отталкнула большинство бандитов. И всё таки, будте осторожны... \n";
cout << " \n";
cout << " \n";
cout << " \n";
cout << " \n";
cout << " \n";
Sist();
cout << " \n";
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: 0 \n"; //Отображение коробля и панели инструментов
y = x*2;
while (y>-1) {cout << " \n";
y = y - 1;}
kor();
cout << " Жизни: " << live << "                                                         Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
while (z != 101){
if (sist == 5) {system("cls");//Бой с главным боссом
cout << "    И вот... Она перед вами! Чудовищная смесь металла с огромным насекомым!    \n";
cout << "              Некоторые жуки, заметив ваше приближение к королеве              \n";
cout << " летят на перехват. У вас мало времени! Вспомните всё, что вам известно, чтобы \n";
cout << "       разделаться с монстром или умрите в клешнях этих жутких чудовищь.       \n";
for (int i = 7; i > 0; i--)cout << "\n";
kor();//Здесь и далее: функция изображения коробля
_getch();//Отображение коробля
while (Boss > 0 && z != 101){//Пока босс не умрёт или игрок не захочет выйти	
if (boss == 0)boss = f;
else boss = 0;
if (pop == 1 && zad !=0){
zad--;
if (boss < 3) boss = 0;
}
else if (pop == 5 && zad !=0){
zad--;
if (boss > 3) boss = 0;
}
if (sch < 10)sch++;
else {E++;
live++;
sch =0;
}//Положение босса и игрока в пространстве, условия попадания
time();//Здесь и далее: функция, настраивающая скорость выстрелов боссов, их движение и движение астероидов паралельно с вводом переменных
if (As > 0) As--;
z = static_cast<int>(s);
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                    ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
r = f;
Wt = live;//Положение коробля, настройка щита и вооружения игрока
system("cls");
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
cout << "       /|_____\\   /|\\****|****/||___________||\\****|****/|\\   /_____|\\ " << " \n";//Здесь и далее: текстурка босса в различных положениях и при различных действиях (выстрелы, повреждения и т.п.)
cout << "      //\\\\  //\\\\_/\\|/\\***|***/\\||\\   /|\\   /||/\\***|***/\\|/\\_//\\\\  //\\\\ " << " \n";
switch (boss){
case 0: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_____/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_____/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\_______/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|           |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|           |* *      / /   \\||||/\\|||| " << " \n";
if (z == 32){if (f == 1){
if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\* *  **|* |                                           \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|* ^                                           \\||/  \\||/ " << " \n";
else if (weap == 1) cout << "      \\* *  **|* |            \\ \\___________/ /              \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|* ^            \\ \\___________/ /              \\||/  \\||/ " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1)cout << "      \\||/  \\||/ |                                           *|*   * */ " << " \n";
else cout << "      \\||/  \\||/ ^                                           *|*   * */ " << " \n";
else if (weap == 1) cout << "      \\||/  \\||/ |            \\ \\___________/ /              *|*   * */ " << " \n";
else cout << "      \\||/  \\||/ ^            \\ \\___________/ /              *|*   * */ " << " \n";}
else {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/ |                                           \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/ ^                                           \\||/  \\||/ " << " \n";
else if (weap == 1) cout << "      \\||/  \\||/ |            \\ \\___________/ /              \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/ ^            \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "        *     *  |                                            ^^    || " << " \n";
else cout << "        *     *  ^                                            ^^    || " << " \n";
else if (weap == 1) cout << "        *     *  |             \\_____________/                ^^    || " << " \n";
else cout << "        *     *  ^             \\_____________/                ^^    || " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4) cout << "       ||    ^^  |                                            *     |* " << " \n";
else if (weap == 1) cout << "       ||    ^^  |             \\_____________/                *     |* " << " \n";}
else {if (shit == 4) cout << "       ||    ^^  |                                            ^^    || " << " \n";
else if (weap == 1) cout << "       ||    ^^  |             \\_____________/                ^^    || " << " \n";
else cout << "       ||    ^^  ^             \\_____________/                ^^    || " << " \n";}
if (pop == 1 && zad != 0) cout << "        *        |                                                  || " << " \n";
else if (pop == 5 && zad != 0) if (weap == 1)cout << "       ||        |                                                  *  " << " \n";
else cout << "       ||        ^                                                  *  " << " \n";
else if (weap == 1)cout << "       ||        |                                                  || " << " \n";
else cout << "       ||        ^                                                  || " << " \n";
if (weap == 1)cout << "       |         |\n";
else cout << "       ^         ^ \n";
pop = 1;
zad = 5;
o=o+100;
}
else if (f == 2){
if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\* *  **|*    |                                        \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*    ^                                        \\||/  \\||/ " << " \n";
else if (weap == 1) cout << "      \\* *  **|*    |         \\ \\___________/ /              \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*    ^         \\ \\___________/ /              \\||/  \\||/ " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/    |                                        *|*   * */ " << " \n";
else cout << "      \\||/  \\||/    ^                                        *|*   * */ " << " \n";
else if (weap == 1) cout << "      \\||/  \\||/    |         \\ \\___________/ /              *|*   * */ " << " \n";
else cout << "      \\||/  \\||/    ^         \\ \\___________/ /              *|*   * */ " << " \n";}
else {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/    |                                        \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/    ^                                        \\||/  \\||/ " << " \n";
else if (weap == 1) cout << "      \\||/  \\||/    |         \\ \\___________/ /              \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/    ^         \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "        *     *     |         |                               ^^    || " << " \n";
else cout << "        *     *     ^         ^                               ^^    || " << " \n";
else if (weap == 1)cout << "        *     *     |         |\\_____________/                ^^    || " << " \n";
else cout << "        *     *     ^         ^\\_____________/                ^^    || " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1)cout << "       ||    ^^     |         |                               *     |* " << " \n";
else cout << "       ||    ^^     |^         ^                               *     |* " << " \n";
else if (weap == 1)cout << "       ||    ^^     |         |\\_____________/                *     |* " << " \n";
else cout << "       ||    ^^     ^         ^\\_____________/                *     |* " << " \n";}
else {if (shit == 4) if (weap == 1) cout << "       ||    ^^     |         |                               ^^    || " << " \n";
else cout << "       ||    ^^     ^         ^                               ^^    || " << " \n";
else if (weap == 1)cout << "       ||    ^^     |         |\\_____________/                ^^    || " << " \n";
else cout << "       ||    ^^     ^         ^\\_____________/                ^^    || " << " \n";}
if (pop == 1 && zad != 0) if (weap == 1)cout << "        *           |         |                                     || " << " \n";
else cout << "        *           ^         ^                                     || " << " \n";
else if (pop == 5 && zad != 0) if (weap == 1) cout << "       ||           |         |                                     *  " << " \n";
else cout << "       ||           ^         ^                                     *  " << " \n";
else if (weap == 1) cout << "       ||           |         |                                     || " << " \n";
else cout << "       ||           ^         ^                                     || " << " \n";
if (weap == 1)cout << "                    |         |\n";
else cout << "                    ^         ^ \n";
if (shit == 1)shit = 3;
else if (shit == 2)shit = 4;
o=o+100;
}
else if (f == 3){if (pop == 1 && zad != 0) {if (shit == 4)  cout << "      \\* *  **|*                                             \\||/  \\||/ " << " \n";
				 else cout << "      \\* *  **|*              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) cout << "      \\||/  \\||/                                             *|*   * */ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /              *|*   * */ " << " \n";}
				 else {if (shit == 4) cout << "      \\||/  \\||/                                             \\||/  \\||/ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
				 if (pop == 1 && zad != 0) {if (shit == 4) cout << "        *     *                                               ^^    || " << " \n";
				 else cout << "        *     *                \\_____________/                ^^    || " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) cout << "       ||    ^^                                               *     |* " << " \n";
				 else cout << "       ||    ^^                \\_____________/                *     |* " << " \n";}
				 else {if (shit == 4) cout << "       ||    ^^                                               ^^    || " << " \n";
				 else cout << "       ||    ^^                \\_____________/                ^^    || " << " \n";}
				 if (pop == 1 && zad != 0) if (weap == 1) cout << "        *                        |         |                        || " << " \n";
				 else cout << "        *                        ^         ^                        || " << " \n";
				 else if (pop == 5 && zad != 0) if (weap == 1) cout << "       ||                        |         |                        *  " << " \n";
				 else cout << "       ||                        ^         ^                        *  " << " \n";
				 else if (weap == 1)cout << "       ||                        |         |                        || " << " \n";
				 else cout << "       ||                        ^         ^                        || " << " \n";
				 if (weap == 1)cout << "                                 |         |\n";
				 else cout << "                                 ^         ^\n";
if (shit == 4) Boss = Boss - weap;
}
else if (f == 4){if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\* *  **|*                                        |    \\||/  \\||/ " << " \n";
				 else cout << "      \\* *  **|*                                        ^    \\||/  \\||/ " << " \n";
				 else if (weap == 1) cout << "      \\* *  **|*              \\ \\___________/ /         |    \\||/  \\||/ " << " \n";
				 else cout << "      \\* *  **|*              \\ \\___________/ /         ^    \\||/  \\||/ " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/                                        |    *|*   * */ " << " \n";
				 else cout << "      \\||/  \\||/                                        ^    *|*   * */ " << " \n";
				 else if (weap == 1) cout << "      \\||/  \\||/              \\ \\___________/ /         |    *|*   * */ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /         ^    *|*   * */ " << " \n";}
				 else {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/                                        |    \\||/  \\||/ " << " \n";
				 else cout << "      \\||/  \\||/                                        ^    \\||/  \\||/ " << " \n";
				 else if (weap == 1) cout << "      \\||/  \\||/              \\ \\___________/ /         |    \\||/  \\||/ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /         ^    \\||/  \\||/ " << " \n";}
				 if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "        *     *                               |         |     ^^    || " << " \n";
				 else cout << "        *     *                               ^         ^     ^^    || " << " \n";
				 else if (weap == 1) cout << "        *     *                \\_____________/|         |     ^^    || " << " \n";
				 else cout << "        *     *                \\_____________/^         ^     ^^    || " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1) cout << "       ||    ^^                               |         |     *     |* " << " \n";
				 else cout << "       ||    ^^                               ^         ^     *     |* " << " \n";
				 else if (weap == 1) cout << "       ||    ^^                \\_____________/|         |     *     |* " << " \n";
				 else cout << "       ||    ^^                \\_____________/^         ^     *     |* " << " \n";}
				 else {if (shit == 4) if (weap == 1) cout << "       ||    ^^                               |         |     ^^    || " << " \n";
				 else cout << "       ||    ^^                               ^         ^     ^^    || " << " \n";
				 else if (weap == 1) cout << "       ||    ^^                \\_____________/|         |     ^^    || " << " \n";
				 else cout << "       ||    ^^                \\_____________/^         ^     ^^    || " << " \n";}
				 if (pop == 1 && zad != 0) if (weap == 1) cout << "        *                                     |         |           || " << " \n";
				 else cout << "        *                                     ^         ^           || " << " \n";
				 else if (pop == 5 && zad != 0) if (weap == 1) cout << "       ||                                     |         |           *  " << " \n";
				 else cout << "       ||                                     ^         ^           *  " << " \n";
				 else if (weap == 1) cout << "       ||                                     |         |           || " << " \n";
				 else cout << "       ||                                     ^         ^           || " << " \n";
				 if (weap == 1) cout << "                                              |         |   \n";
				 else cout << "                                              ^         ^   \n";
if (shit == 1)shit = 2;
else if (shit == 3)shit = 4;
o=o+100;				 
}
else if (f == 5){if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\* *  **|*                                           | \\||/  \\||/ " << " \n";
				 else cout << "      \\* *  **|*                                           ^ \\||/  \\||/ " << " \n";
				 else if (weap == 1) cout << "      \\* *  **|*              \\ \\___________/ /            | \\||/  \\||/ " << " \n";
				 else cout << "      \\* *  **|*              \\ \\___________/ /            ^ \\||/  \\||/ " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/                                           | *|*   * */ " << " \n";
				 else cout << "      \\||/  \\||/                                           ^ *|*   * */ " << " \n";
				 else if (weap == 1) cout << "      \\||/  \\||/              \\ \\___________/ /            | *|*   * */ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /            ^ *|*   * */ " << " \n";}
				 else {if (shit == 4) if (weap == 1) cout << "      \\||/  \\||/                                           | \\||/  \\||/ " << " \n";
				 else cout << "      \\||/  \\||/                                           ^ \\||/  \\||/ " << " \n";
				 else if (weap == 1) cout << "      \\||/  \\||/              \\ \\___________/ /            | \\||/  \\||/ " << " \n";
				 else cout << "      \\||/  \\||/              \\ \\___________/ /            ^ \\||/  \\||/ " << " \n";}
				 if (pop == 1 && zad != 0) {if (shit == 4) if (weap == 1) cout << "        *     *                                          |  ^^    || " << " \n";
				 else cout << "        *     *                                          ^  ^^    || " << " \n";
				 else if (weap == 1) cout << "        *     *                \\_____________/             |  ^^    || " << " \n";
				 else cout << "        *     *                \\_____________/             ^  ^^    || " << " \n";}
				 else if (pop == 5 && zad != 0) {if (shit == 4) if (weap == 1) cout << "       ||    ^^                                            |  *     |* " << " \n";
				 else cout << "       ||    ^^                                            ^  *     |* " << " \n";
				 else if (weap == 1) cout << "       ||    ^^                \\_____________/             |  *     |* " << " \n";
				 else cout << "       ||    ^^                \\_____________/             ^  *     |* " << " \n";}
				 else {if (shit == 4) if (weap == 1) cout << "       ||    ^^                                            |  ^^    || " << " \n";
				 else cout << "       ||    ^^                                            ^  ^^    || " << " \n";
				 else if (weap == 1) cout << "       ||    ^^                \\_____________/             |  ^^    || " << " \n";
				 else cout << "       ||    ^^                \\_____________/             ^  ^^    || " << " \n";}
				 if (pop == 1 && zad != 0) if (weap == 1) cout << "        *                                                  |        || " << " \n";
				 else cout << "        *                                                  ^        || " << " \n";
				 else if (pop == 5 && zad != 0) if (weap == 1) cout << "       ||                                                  |        *  " << " \n";
				 else cout << "       ||                                                  ^        *  " << " \n";
				 else if (weap == 1) cout << "       ||                                                  |        || " << " \n";
				 else cout << "       ||                                                  ^        || " << " \n";
				 if (weap == 1) cout << "                                                           |         |\n";
				 else cout << "                                                           ^         ^\n";
pop = 5;
zad = 5;
o=o+100;
}
}
else {if (pop == 1 && zad != 0) {if (shit == 4) cout << "      \\* *  **|*                                             \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
else if (pop == 5 && zad != 0){if (shit == 4) cout << "      \\||/  \\||/                                             *|*   * */ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /              *|*   * */ " << " \n";}
else {if (shit == 4) cout << "      \\||/  \\||/                                             \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0) {if (shit == 4) cout << "        *     *                                               ^^    || " << " \n";
else cout << "        *     *                \\_____________/                ^^    || " << " \n";}
else if (pop == 5 && zad != 0){if (shit == 4) cout << "       ||    ^^                                               *     |* " << " \n";
else cout << "       ||    ^^                \\_____________/                *     |* " << " \n";}
else {if (shit == 4) cout << "       ||    ^^                                               ^^    || " << " \n";
else cout << "       ||    ^^                \\_____________/                ^^    || " << " \n";}
if (pop == 1 && zad != 0) cout << "        *                                                           || " << " \n";
else if (pop == 5 && zad != 0)cout << "       ||                                                           *  " << " \n";
else cout << "       ||                                                           || " << " \n";
cout << "\n";
}
kor();
break;
}
case 1: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_____/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_____/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\_______/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|           |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|           |* *      / /   \\||||/\\|||| " << " \n";
if (pop == 5 && zad != 0) {if (shit == 4) cout << "      \\||/  \\||/                                             *|*   * */ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /              *|*   * */ " << " \n";}
else {if (shit == 4) cout << "      \\||/  \\||/                                             \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 5 && zad != 0) {if (shit == 4) cout << "       ||    ^^                                               *     |* " << " \n";
else cout << "       ||    ^^                \\_____________/                *     |* " << " \n";}
else {if (shit == 4) cout << "       ||    ^^                                               ^^    || " << " \n";
else cout << "       ||    ^^                \\_____________/                ^^    || " << " \n";}
if (pop == 5 && zad != 0) cout << "       ||   /||\\                                                    *  " << " \n";
else cout << "       ||   /||\\                                                    || " << " \n";
cout << "       ||  / || \\ \n";
if (f == boss) {kor();
if (As == 0)live--;}
else {//Функция при выстреле 1-ого оружия босса
cout << "      ";
for (int i = 1; i < 13; i++){
for (int j = 1; j < 6; j++) {
if (j == 1){if (i == 1) {if (f == 2){if (z == 32) if (weap == 1) cout << "        || /  ||  \\  |   /^\\   | ";
else cout << "        || /  ||  \\  ^   /^\\   ^ ";
	else cout <<" || /  ||  \\      /^\\     ";}
		else cout << " || /  ||  \\              ";}
else if (i == 2) {if (f == 2){ if (z == 32) if (weap == 1) cout << " ||/   ||   \\\\|/  |-|  \\|/";
else cout << " ||/   ||   \\\\^/  |-|  \\^/";
	else cout <<" ||/   ||   \\ ^   |-|   ^ ";}
		else cout << " ||/   ||   \\             ";}
else if (i == 3) {if (f == 2)cout <<" ||    ||    /^\\ //^\\\\ /^\\";
		else cout <<" ||    ||    \\            ";}
		else if (i == 4) {if (f == 2)cout <<" ||    ||    |-||-----||-|";
			else cout <<" ||    ||     \\           ";}
			else if (i == 5) {if (f == 2)cout <<"/||    ||    | || \\^/ || |";
				else cout <<"/||    ||      \\          ";}
				else if (i == 6) {if (f == 2)cout <<" ||    ||    | || / \\ || |";
					else  cout <<" ||    ||       \\         ";}
					else if (i == 7) {if (f == 2)cout <<" ||    ||    | ||-----|| |";
						else cout <<" ||    ||        \\        ";}
						else if (i == 8) {if (f == 2)cout <<" ||    ||    |-|\\\\\\^///|-|";
							else cout <<" ||    ||         \\       ";}
							else if (i == 9) {if (f == 2)cout <<" ||    ||    \\_/ |---| \\_/";
								else cout <<" ||    ||          \\      ";}
								else if (i == 10) {if (f == 2)cout <<" ||    ||     ^\\ \\___/  ^ ";
									else cout <<" ||    ||           \\     ";}
									else if (i == 11) {if (f == 2)cout <<" ||    ||    /^\\  /^\\  /^\\";
										else cout <<" ||    ||            \\    ";}
										else if (i == 12) {if (f == 2)cout <<" ||    ||        /^^^\\    ";
											else cout <<" ||    ||             \\   ";}
											j++;}
else if (j == f){ if (i == 1){if (z == 32) if (weap == 1) cout << " |   /^\\   |";
else cout << " ^   /^\\   ^";
        	else cout <<"     /^\\     ";}
	else if (i == 2){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
         	else cout <<" ^   |-|   ^ ";}
		else if (i == 3) cout <<"/^\\ //^\\\\ /^\\";
			else if (i == 4) cout <<"|-||-----||-|";
				else if (i == 5) cout <<"| || \\^/ || |";
					else if (i == 6) cout <<"| || / \\ || |";
						else if (i == 7) cout <<"| ||-----|| |";
							else if (i == 8) cout <<"|-|\\\\\\^///|-|";
								else if (i == 9) cout <<"\\_/ |---| \\_/";
									else if (i == 10) cout <<" ^  \\___/  ^ ";
										else if (i == 11) cout <<"/^\\  /^\\  /^\\";
											else if (i == 12) cout <<"    /^^^\\    ";}
	else cout << "             ";
}
cout << " \n";
if (i != 12)cout << "      ";
}
if (f == 2) live--;
}
break;
}
case 2: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_____/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_____/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\_______/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|           |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|           |* *      / /   \\||||/\\|||| " << " \n";
if (pop == 5 && zad != 0)  {if (shit == 4) cout << "      \\||/  \\||/     \\ \\                                     *|*   * */ " << " \n";
else cout << "      \\||/  \\||/     \\ \\      \\ \\___________/ /              *|*   * */ " << " \n";}
else  {if (shit == 4) cout << "      \\||/  \\||/     \\ \\                                     \\||/  \\||/ " << " \n";
else  cout << "      \\||/  \\||/     \\ \\      \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 5 && zad != 0)  {if (shit == 4) cout << "       ||    ^^       \\ \\                                     *     |* " << " \n";
else cout << "       ||    ^^       \\ \\      \\_____________/                *     |* " << " \n";}
else  {if (shit == 4) cout << "       ||    ^^       \\ \\                                     ^^    || " << " \n";
else cout << "       ||    ^^       \\ \\      \\_____________/                ^^    || " << " \n";}
if (pop == 5 && zad != 0) cout << "       ||              \\ \\                                          *  " << " \n";
else cout << "       ||              \\ \\                                          || " << " \n";
cout << "                        \\ \\ \n";
if (f == boss) {kor();
if (As == 0)live--;}
else {//Функция при выстреле 2-ого оружия босса
	cout << "      ";
for (int i = 1; i < 13; i++){
for (int j = 1; j < 6; j++) {
if (j == f){ if (i == 1){if (z == 32) if (weap == 1) cout << " |   /^\\   |";
else cout << " ^   /^\\   ^";
        	else cout <<"     /^\\     ";}
	else if (i == 2){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
         	else cout <<" ^   |-|   ^ ";}
		else if (i == 3) cout <<"/^\\ //^\\\\ /^\\";
			else if (i == 4) cout <<"|-||-----||-|";
				else if (i == 5) cout <<"| || \\^/ || |";
					else if (i == 6) cout <<"| || / \\ || |";
						else if (i == 7) cout <<"| ||-----|| |";
							else if (i == 8) cout <<"|-|\\\\\\^///|-|";
								else if (i == 9) cout <<"\\_/ |---| \\_/";
									else if (i == 10) cout <<" ^  \\___/  ^ ";
										else if (i == 11) cout <<"/^\\  /^\\  /^\\";
											else if (i == 12) cout <<"    /^^^\\    ";}
else if (j == 2){if (i == 1) {if (f == 3){if (z == 32) if (weap == 1) cout << "    \\ \\       |   /^\\   |";
else cout << "    \\ \\       ^   /^\\   ^";
        	else cout <<"      \\ \\         /^\\     ";}
						else cout << "      \\ \\                  ";}
	else if (i == 2) {if (f == 3){ if (z == 32) if (weap == 1) cout << "      \\ \\     \\|/  |-|  \\|/";
	else  cout << "      \\ \\     \\^/  |-|  \\^/";
         	else cout <<"       \\ \\    ^   |-|   ^ ";}
		else cout <<"       \\ \\                  ";}
		else if (i == 3) {if (f == 3)cout <<"        \\ \\  /^\\ //^\\\\ /^\\";
			else cout <<"        \\ \\                 ";}
			else if (i == 4) {if (f == 3)cout <<"         \\ \\ |-||-----||-|";
				else cout <<"         \\ \\                ";}
				else if (i == 5) {if (f == 3)cout <<"          \\ \\| || \\^/ || |";
					else cout <<"          \\ \\               ";}
					else if (i == 6) {if (f == 3)cout <<"           \\ | || / \\ || |";
						else  cout <<"           \\ \\              ";}
						else if (i == 7) {if (f == 3)cout <<"            \\| ||-----|| |";
							else cout <<"            \\ \\             ";}
							else if (i == 8) {if (f == 3)cout <<"             |-|\\\\\\^///|-|";
								else cout <<"             \\ \\            ";}
								else if (i == 9) {if (f == 3)cout <<"             \\_/ |---| \\_/";
									else cout <<"              \\ \\           ";}
									else if (i == 10) {if (f == 3)cout <<"              ^\\ \\___/  ^ ";
										else cout <<"               \\ \\          ";}
										else if (i == 11) {if (f == 3)cout <<"             /^\\  /^\\  /^\\";
											else cout <<"                \\ \\         ";}
											else if (i == 12) {if (f == 3)cout <<"                 /^^^\\    ";
												else cout <<"                 \\ \\        ";}
											j++;}
	else cout << "             ";
}
cout << " \n";
if (i != 12)cout << "      ";
}
if (f == 3) live--;
}
break;
}
case 3: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_|||_/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_|||_/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\__|||__/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|    |||    |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|    |||    |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|    |||    |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|    |||    |* *      / /   \\||||/\\|||| " << " \n";
if (pop == 1 && zad != 0) {if (shit == 4) cout << "      \\* *  **|*                     |||                     \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*              \\ \\____|||____/ /              \\||/  \\||/ " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4)cout << "      \\||/  \\||/                     |||                     *|*   * */ " << " \n";
else cout << "      \\||/  \\||/              \\ \\____|||____/ /              *|*   * */ " << " \n";}
else {if (shit == 4) cout << "      \\||/  \\||/                     |||                     \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/              \\ \\____|||____/ /              \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0) {if (shit == 4) cout << "        *     *                      |||                      ^^    || " << " \n";
else cout << "        *     *                \\_____|||_____/                ^^    || " << " \n";}
else if (pop == 5 && zad != 0) {if (shit == 4) cout << "       ||    ^^                      |||                      *     |* " << " \n";
else cout << "       ||    ^^                \\_____|||_____/                *     |* " << " \n";}
else {if (shit == 4) cout << "       ||    ^^                      |||                      ^^    || " << " \n";
else cout << "       ||    ^^                \\_____|||_____/                ^^    || " << " \n";}
if (pop == 1 && zad != 0) cout << "        *                            |||                            || " << " \n";
else if (pop == 5 && zad != 0) cout << "       ||                            |||                            *  " << " \n";
else cout << "       ||                            |||                            || " << " \n";
cout << "                                     |||\n";
if (f == boss){kor();
if (As == 0)live--;}
else {//Функция при выстреле 3-ого оружия босса
	cout << "      ";
for (int i = 1; i < 13; i++){
for (int j = 1; j < 6; j++) {
if (j == f){ if (i == 1){if (z == 32) if (weap == 1) cout << " |   /^\\   |";
else cout << " ^   /^\\   ^";
        	else cout <<"     /^\\     ";}
	else if (i == 2){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
         	else cout <<" ^   |-|   ^ ";}
		else if (i == 3) cout <<"/^\\ //^\\\\ /^\\";
			else if (i == 4) cout <<"|-||-----||-|";
				else if (i == 5) cout <<"| || \\^/ || |";
					else if (i == 6) cout <<"| || / \\ || |";
						else if (i == 7) cout <<"| ||-----|| |";
							else if (i == 8) cout <<"|-|\\\\\\^///|-|";
								else if (i == 9) cout <<"\\_/ |---| \\_/";
									else if (i == 10) cout <<" ^  \\___/  ^ ";
										else if (i == 11) cout <<"/^\\  /^\\  /^\\";
											else if (i == 12) cout <<"    /^^^\\    ";}
else if (j == 3) cout << "     |||     ";
	else cout << "             ";
}
cout << " \n";
if (i != 12)cout << "      ";
}
}
break;
}
case 4: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_____/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_____/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\_______/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|           |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|           |* *      / /   \\||||/\\|||| " << " \n";
if (pop == 1 && zad != 0)  {if (shit == 4) cout << "      \\* *  **|*                                     / /     \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*              \\ \\___________/ /      / /     \\||/  \\||/ " << " \n";}
else  {if (shit == 4) cout << "      \\||/  \\||/                                     / /     \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /      / /     \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0)  {if (shit == 4) cout << "        *     *                                      / /       ^^    || " << " \n";
else cout << "        *     *                \\_____________/      / /       ^^    || " << " \n";}
else  {if (shit == 4) cout << "       ||    ^^                                     / /       ^^    || " << " \n";
else cout << "       ||    ^^                \\_____________/      / /       ^^    || " << " \n";}
if (pop == 1 && zad != 0) cout << "        *                                          / /              || " << " \n";
else cout << "       ||                                          / /              || " << " \n";
cout << "                                                  / /  \n";
if (f == boss) {kor();
if (As == 0)live--;}
else {//Функция при выстреле 4-ого оружия босса
	cout << "      ";
for (int i = 1; i < 13; i++){
for (int j = 1; j < 6; j++) {
if (j == f && f !=3){ if (i == 1){if (z == 32) if (weap == 1) cout << " |   /^\\   |";
else cout << " ^   /^\\   ^";
        	else cout <<"     /^\\     ";}
	else if (i == 2){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
         	else cout <<" ^   |-|   ^ ";}
		else if (i == 3) cout <<"/^\\ //^\\\\ /^\\";
			else if (i == 4) cout <<"|-||-----||-|";
				else if (i == 5) cout <<"| || \\^/ || |";
					else if (i == 6) cout <<"| || / \\ || |";
						else if (i == 7) cout <<"| ||-----|| |";
							else if (i == 8) cout <<"|-|\\\\\\^///|-|";
								else if (i == 9) cout <<"\\_/ |---| \\_/";
									else if (i == 10) cout <<" ^  \\___/  ^ ";
										else if (i == 11) cout <<"/^\\  /^\\  /^\\";
											else if (i == 12) cout <<"    /^^^\\    ";}
else if (j == 3){if (i == 1) {if (f == 3){if (z == 32) if (weap == 1) cout << " |   /^\\   |      / /     ";
else cout << " ^   /^\\   ^      / /     ";
        	else cout <<"     /^\\         / /     ";}
						else cout << "                 / /      ";}
	else if (i == 2) {if (f == 3){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/   / /      ";
	else cout << "\\^/  |-|  \\^/   / /      ";
         	else cout <<" ^   |-|   ^    / /      ";}
		else cout <<"                / /       ";}
		else if (i == 3) {if (f == 3)cout <<"/^\\ //^\\\\ /^\\  / /       ";
			else cout <<"               / /        ";}
			else if (i == 4) {if (f == 3)cout <<"|-||-----||-| / /        ";
				else cout <<"              / /         ";}
				else if (i == 5) {if (f == 3)cout <<"| || \\^/ || |/ /         ";
					else cout <<"             / /          ";}
					else if (i == 6) {if (f == 3)cout <<"| || / \\ || | /            ";
						else  cout <<"            / /           ";}
						else if (i == 7) {if (f == 3)cout <<"| ||-----|| |/            ";
							else cout <<"           / /            ";}
							else if (i == 8) {if (f == 3)cout <<"|-|\\\\\\^///|-|             ";
								else cout <<"          / /             ";}
								else if (i == 9) {if (f == 3)cout <<"\\_/ |---| \\_/             ";
									else cout <<"         / /              ";}
									else if (i == 10) {if (f == 3)cout <<" ^  \\___/ /^              ";
										else cout <<"        / /               ";}
										else if (i == 11) {if (f == 3)cout <<"/^\\  /^\\  /^\\             ";
											else cout <<"       / /                ";}
											else if (i == 12) {if (f == 3)cout <<"    /^^^\\                 ";
												else cout <<"      / /                 ";}
											j++;}
	else cout << "             ";
}
cout << " \n";
if (i != 12)cout << "      ";
}
if (f == 3) live--;
}
break;
}
case 5: {
cout << "      |\\/|  |\\/| \\\\|//\\_/_\\_/\\\\|\\ [\\_____/] /|//\\_/_\\_/\\\\|// |\\/|  |\\/| " << " \n";
cout << "      ||||  ||||  |_____________/\\ \\_____/ /\\_____________|  ||||  |||| " << " \n";
cout << "      ||||  |||| / \\/\\/ /^\\ \\/\\///\\_______/\\\\\\/\\/ /^\\ \\/\\/ \\ ||||  |||| " << " \n";
if (shit == 1)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |/ /      / /   \\||||/\\|||| " << " \n";
else if (shit == 2)cout << "      ||||/\\||||/   \\ \\      \\ \\|           |* *      / /   \\||||/\\|||| " << " \n";
else if (shit == 3)cout << "      ||||/\\||||/   \\ \\      * *|           |/ /      / /   \\||||/\\|||| " << " \n";
else cout << "      ||||/\\||||/   \\ \\      * *|           |* *      / /   \\||||/\\|||| " << " \n";
if (pop == 1 && zad != 0) {if (shit == 4) cout << "      \\* *  **|*                                            \\||/  \\||/ " << " \n";
else cout << "      \\* *  **|*              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
else {if (shit == 4) cout << "      \\||/  \\||/                                             \\||/  \\||/ " << " \n";
else cout << "      \\||/  \\||/              \\ \\___________/ /              \\||/  \\||/ " << " \n";}
if (pop == 1 && zad != 0) {if (shit == 4) cout << "        *     *                                               ^^    || " << " \n";
else cout << "        *     *                \\_____________/                ^^    || " << " \n";}
else {if (shit == 4) cout << "       ||    ^^                                               ^^    || " << " \n";
else cout << "       ||    ^^                \\_____________/                ^^    || " << " \n";}
if (pop == 1 && zad != 0) cout << "        *                                                    /||\\   || " << " \n";
else cout << "       ||                                                    /||\\   || " << " \n";
cout << "                                                            / || \\  || \n";
if (f == boss) {kor();
if (As == 0)live--;}
else {//Функция при выстреле 5-ого оружия босса
	cout << "      ";
for (int i = 1; i < 13; i++){
for (int j = 1; j < 6; j++) {
if (j == f && f != 4){ if (i == 1){if (z == 32) if (weap == 1) cout << " |   /^\\   |";
else cout << " ^   /^\\   ^";
        	else cout <<"     /^\\     ";}
	else if (i == 2){ if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
         	else cout <<" ^   |-|   ^ ";}
		else if (i == 3) cout <<"/^\\ //^\\\\ /^\\";
			else if (i == 4) cout <<"|-||-----||-|";
				else if (i == 5) cout <<"| || \\^/ || |";
					else if (i == 6) cout <<"| || / \\ || |";
						else if (i == 7) cout <<"| ||-----|| |";
							else if (i == 8) cout <<"|-|\\\\\\^///|-|";
								else if (i == 9) cout <<"\\_/ |---| \\_/";
									else if (i == 10) cout <<" ^  \\___/  ^ ";
										else if (i == 11) cout <<"/^\\  /^\\  /^\\";
											else if (i == 12) cout <<"    /^^^\\    ";}
else if (j == 4){if (i == 1) {if (f == 4){if (z == 32) if (weap == 1) cout << " |   /^\\   |  /  ||  \\ || ";
else cout << " ^   /^\\   ^  /  ||  \\ || ";
	else cout <<"     /^\\      /  ||  \\ || ";}
		else cout << "              /  ||  \\ || ";}
else if (i == 2) {if (f == 4){ if (z == 32) if (weap == 1) cout << "\\\\|/  |-|  \\|//   ||   \\|| ";
else cout << "\\\\^/  |-|  \\^//   ||   \\|| ";
	else cout <<" ^   |-|   ^ /   ||   \\|| ";}
		else cout << "             /   ||   \\|| ";}
else if (i == 3) {if (f == 4)cout <<"/^\\ //^\\\\ /^\\    ||    || ";
		else cout <<"            /    ||    || ";}
		else if (i == 4) {if (f == 4)cout <<"|-||-----||-|    ||    || ";
			else cout <<"           /     ||    || ";}
			else if (i == 5) {if (f == 4)cout <<"| || \\^/ || |    ||    ||\\";
				else cout <<"          /      ||    || ";}
				else if (i == 6) {if (f == 4)cout <<"| || / \\ || |    ||    || ";
					else  cout <<"         /       ||    || ";}
					else if (i == 7) {if (f == 4)cout <<"| ||-----|| |    ||    || ";
						else cout <<"        /        ||    || ";}
						else if (i == 8) {if (f == 4)cout <<"|-|\\\\\\^///|-|    ||    || ";
							else cout <<"       /         ||    || ";}
							else if (i == 9) {if (f == 4)cout <<"\\_/ |---| \\_/    ||    || ";
								else cout <<"      /          ||    || ";}
								else if (i == 10) {if (f == 4)cout <<" ^\\ \\___/  ^     ||    || ";
									else cout <<"     /           ||    || ";}
									else if (i == 11) {if (f == 4)cout <<"/^\\  /^\\  /^\\    ||    || ";
										else cout <<"    /            ||    || ";}
										else if (i == 12) {if (f == 4)cout <<"    /^^^\\        ||    || ";
											else cout <<"   /             ||    || ";}
											j++;}
	else cout << "             ";
}
cout << " \n";
if (i != 12)cout << "      ";
}
if (f == 4) live--;
}
break;
}
}
cout << "\n";
cout << " Жизни: " << live << "                      Жизни матки: " << Boss << "                    Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
if (live == 0) Boss = -1;
}
sist++;
}
if (Boss == 0){system("cls");//При победе над боссом
o = o+1500;
cout << "Залп ваших орудий пронзает чёрную пустоту. Издав не то крик, не то металический\n";
cout << "  скрежет, матка, изрезанная лучами, безвольно повисает в невесомости! Жуки,   \n";
cout << " спешащие к вам, замирают, подобно королеве. Вы обессилено падаете на кресло.  \n";
cout << "        Это победа!!! Вы единолично остановили нашествие внеземной расы!       \n";
cout << "                 Теперь впереди долгий и спокойный путь домой...               \n";
cout << "\n";
cout << "       /|_____\\   /*\\*  *|**  /|**__________||\\**  |**  /|\\   /_**__|* " << " \n";
cout << "      / \\\\  /**\\_/* *\\ * |***/\\||\\   /**   /||/\\* *| **/\\*/\\_/**\\  /**\\ " << " \n";
cout << "      |**|  |\\/|  * //*  *\\_** |\\  *__*__/] /|*/\\*/_\\_/\\\\|/* |*/|  **/*" << " \n";
cout << "      |*||  * **  |_____________/\\ \\*____/ /\\______**____*|  ||**  ||*|" << " \n";
cout << "      **|  ||*| / */\\** **\\ \\/\\///**____*_/\\\\\\/** /^\\ \\/** \\ **||  |*|*" << " \n";
cout << "      |||*/**|||/   * \\      * *|           |* *      * /   \\||||/**|||" << " \n";
cout << "      \\* *  **|*                                             *|*   * **" << " \n";
cout << "        *     *                                               *     |* " << " \n";
cout << "       *                                                           *   " << " \n";
_getch();
Boss = 1;
boss = 6;
shit = 1;
k[5] = 0;
k[1] = 0;
k[2] = 0;
k[3] = 0;
k[4] = 0;
}
else if (sist == 4 && o == 4510){//Выход на мини-босса при достижении четвёртой системы 
system("cls");
cout << "   Вы подлетаете к последней уцелевшей планете. Штурм идёт полным ходом! Её    \n";
cout << " осаждают крейсеры класса «Пчела»! Уничтожте всех и, на время, спасёте планету \n";
cout << "                                от уничтожения!                                \n";
for (int i = 9; i > 0; i--)cout << "\n";
kor();
_getch();
while (bags != 0 && z != 101){
while (pBoss == 1 && z != 101){	
time();
bag = f;
if (As > 0) As--;
z = static_cast<int>(s);
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                    ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(E!=0 && Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
r = f;
Wt = live;
if (sch < 10)sch++;
else {E++;
sch =0;
}
system("cls");
if (tbag == 1) gal=1;
else gal = 0;
if (tbag == 2)tbag = 0;
else tbag++;
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
//Функция боя с мини-боссом 4-ой системы
	cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << "    /---\\    ";
else if (i == f && z == 32) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << "   /|   |\\   ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << "\\-|*|---|*|-/";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << " \\|*|---|*|/ ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << " /\\*|---|*/\\ ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag) cout << " \\ \\/***\\/ / ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bag){if (z == 32 && i == f) if (weap == 1) cout << " |  |\\^/|  | ";
else cout << " ^  |\\^/|  ^ ";
else if (gal == 1) cout << "  \\ |\\^/| /  ";
else cout << "    |\\^/|    ";}
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
if (gal == 1){
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == bag) cout << "   \\|   |/   ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == bag) cout << "    |   |    ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == bag) cout << "    |   |    ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == bag) cout << "    |   |    ";
else cout << "             ";
cout << " \n";
}
else {for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
}
Kor();
if (z == 32 && f == bag)zbag = zbag - weap;
else if (gal == 1 && f == bag)if (As == 0)live--;
if (live == 0) pBoss = 2;
if (zbag == 0) pBoss = 0;
cout << " Жизни: " << live << "          Жизни жука: " << zbag << "         Кол-во жуков: " << bags << "        Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
}
if (z != 101){system("cls");//При победе над мини-боссом
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
for (int i = bag; i > 1; i--)cout << "             ";
cout << "           ** \\ \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "         /|*  *\\ \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "       *|*|--* ** / \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "       \\|*| *-|* * \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "       ** |*--|*/* \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "         \\/** \\  / \n";
for (int i = bag; i > 1; i--)cout << "             ";
cout << "          | */ \n";
o = o+100;
cout << "\n";
cout << "\n";
cout << "\n";
cout << "\n";
kor();
cout << " Жизни: " << live << "          Жизни жука: " << zbag << "         Кол-во жуков: " << bags << "        Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
_getch();
bags--;
pBoss = 1;
zbag = 3;
}
}
if (z != 101){
per = 2;
k[5] = 0;
k[1] = 0;
k[2] = 0;
k[3] = 0;
k[4] = 0;
sist = 5;
system("cls");
kred = kred + 100;
if (live > 0)ftl();
if (live > 0)Kred();
if (live > 0)cout << "Вы едва уцелели после боя. Однако планета под защитой. Подремонтировавшись, вы \n";
if (live > 0)cout << "готовитесь лететь в свой последний бой. На планете вы узнали, что три попадания\n";
if (live > 0)cout << "в голову матки теоритически могут её уничтожить. Остаётся надеятся, что это так\n"; 
if (live > 0)Sist();//Здесь и далее: функция смены систем
}
}
else o = o+10;
if (sist == 1 && o == 760){//Выход на мини-босса при прохождении первой системы
system("cls");
cout << "Вы проходите пояс астероидов и чувствуете облегчение. Когда впереди показалась \n";
cout << "планета, пригодная для отдыха и ремонта, Ваш путь преградил массивный корабль. \n";
cout << "    Попытки выйти с ним на связь ни к чему не приводят, однако вы замечаете    \n";
cout << " пиратскую символику на обшивке. Кто бы сомневался... (Вы отмечаете необычное  \n";
cout << "   строение корпуса противника. Вероятно, он медлителен, но обладает большой   \n";
cout << "                                   прочностью)                                 \n";
for (int i = 6; i > 0; i--)cout << " \n";
kor();
gal2 = 1;
_getch();
while (zpir > 0 && z != 101){
if (tbag == 1) gal2=1;
else gal2 = 0;
if (tbag == 2){per = rand()%2;
if (per == 0) pir--;
else pir++;
tbag = 0;}
else tbag++;
if (pir == 6)pir=1;
else if (pir == 0)pir=5;
time();
if (As > 0) As--;
z = static_cast<int>(s);
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                     ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(E!=0 && Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
system("cls");
r = f;
Wt = live;
if (sch < 10)sch++;
else {E++;
sch =0;
}
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
//Функция боя с мини-боссом 1-ой системы
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << " _        _  ";
else if (i == f && z == 32) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << "||| ____ ||| ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << "|||///\\\\\\||| ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << " \\\\\\\\\\/////  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << " |-|/--\\|-|  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) cout << "/|-|\\__/|-|\\ ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir){if (gal2 == 1) cout << "||-|/--\\|-|| ";
else cout << "\\|-|/--\\|-|/ ";}
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) {if (z == 32 && i == f) if (weap == 1)cout << " \\^/[\\/]\\^/| ";
else cout << " \\^/[\\/]\\^/^ ";
else if (gal2 == 1) cout << "|\\^/[\\/]\\^/| ";
else cout << " \\^/[\\/]\\^/  ";}
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == pir) {if (z == 32 && i == f) if (weap == 1)cout << " |   \\/    | ";
else cout << " ^   \\/    ^ ";
else if (gal2 == 1) cout << "| |  \\/  | | ";
else cout << "     \\/      ";}
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
if (gal2 == 1 || z == 32){
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == pir && gal2 == 1) cout << "| |      | | ";
else cout << "             ";
}
cout << " \n";
cout << "      ";
if (gal2 == 1 || z == 32){
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (i == pir && gal2 == 1) cout << "| |      | | ";
else cout << "             ";
}
cout << " \n";
Kor();
cout << " Жизни: " << live << "                     Жизни пирата: " << zpir << "                    Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
if (z == 32 && f == pir)zpir = zpir - weap;
else if (gal2 == 1 && f == pir)if (As == 0)live--;
if (live == 0) zpir = -1;
}
if (zpir == 0){//Победа над мини-боссом
ftl();//Здесь и далее: Функция обыска противников
system("cls");
cout << "  Корабль пирата, прорезаный вашим орудием, рассыпается на части. А жаль. Вы   \n";
cout << "                    подписались убивать Жуков, а не людей...                   \n"; 
cout << "               С беспокойным сердцем, вы продолжаете свой путь...              \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       *|*   __ |** \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       ||| */* \\**| \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       |\\* **/**/| \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       ||-|/--*| |  \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       | *|\\*_/**| \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       ||-|/--\\|*| \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       | **\\*]\\^ | \n";
for (int i = pir; i > 1; i--)cout << "             ";
cout << "       |     *   |\n";
kred = kred + 50;
r = f;
while (f>1){cout << "             ";
f = f-1;
}
cout << "      ";
if (weap == 1)cout << " |         | \n";
else cout << " ^         ^ \n";
f = r;
Kor();
_getch();
per = 2;
sist = 2;
o = o+500;
gal2 = 0;
system("cls");
if (live > 0)Kred();//Здесь и далее: Функция магазина
if (live > 0)cout << "На планете вы смогли немного отремонтировать корабль и подзарядить батарею. Так\n";
if (live > 0)cout << " же вы узнали, что прямым попаданием в клещи матки, их можно ненадолго вывести \n";
if (live > 0)cout << " из строя. Это пригодится. А вы тем временем направляетесь к следующей системе.\n";
if (live > 0)cout << "  Система Горм. Так же имеет пояс астероидов, однако благодоря этому почти не  \n";
if (live > 0)cout << "пострадала от нашествия. Однако стоит опасаться одиноких короблей. Будте начеку\n"; 
if (live > 0)Sist();
}
}
if (sist == 2 && o == 2010){//Выход на мини-босса при прохождении второй системы
system("cls");
cout << "  Вы добираетесь до следующей системы. Нашествие добралось и сюда. Вы видите   \n";
cout << " два истребителя класса <<Бабочка>>. Если ничего не предпринять, они разорят   \n";
cout << " всю систему! Не теряя ни минуты, вы направляетесь на перехват. Заметив вас,   \n";
cout << "                         жуки меняют курс. К оружию!                           \n";
for (int i = 8; i > 0; i--)cout << " \n";
kor();
gal3 = 1;
_getch();
bat = 3;
bat1 = 3;
bat2 = 3;
while (bat1 > 0 && z != 101 || bat2 > 0 && z != 101){
time();
if (As > 0) As--;
z = static_cast<int>(s);
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                    ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(E!=0 && Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
system("cls");
r = f;
Wt = live;
if (sch < 10)sch++;
else {E++;
sch =0;
}
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
//Функция боя с мини-боссом 2-ой системы
if (tbag == 2){per = rand()%2;
if (per == 0) bat--;
else bat++;
tbag = 0;}
else tbag++;
if (bat == 5)bat=4;
else if (bat == 1)bat=2;
if (tbag == 1) gal3=1;
else gal3 = 0;
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "  //\\/|\\/\\\\  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "  \\\\\\\\|////  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "   \\\\/|\\//   ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "   //\\|/\\\\   ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "  ////|\\\\\\\\  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == bat-1 && bat1 != 0 || i == bat+1 && bat2 !=0) cout << "  \\\\/\\^/\\//  ";
else if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (gal3 == 1 && i == bat-1 && bat1 != 0 || gal3 == 1 && i == bat+1 && bat2 !=0) cout << "   \\  |  /   ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (gal3 == 1 && i == bat-1 && bat1 != 0 || gal3 == 1 && i == bat+1 && bat2 !=0) cout << "    \\ | /    ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (gal3 == 1 && i == bat-1 && bat1 != 0 || gal3 == 1 && i == bat+1 && bat2 !=0) cout << "     \\|/     ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (gal3 == 1 && i == bat-1 && bat1 != 0 || gal3 == 1 && i == bat+1 && bat2 !=0) cout << "      |      ";
else cout << "             ";
cout << " \n";
cout << "      ";
for (int i=1; i<6; i++)if (i == f && z == 32)if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else if (gal3 == 1 && i == bat-1 && bat1 != 0 || gal3 == 1 && i == bat+1 && bat2 !=0) cout << "      |      ";
else cout << "             ";
cout << " \n";
Kor();
cout << " Жизни: " << live << "       Жизни 1-ого жука: " << bat1 << "      Жизни 1-ого жука: " << bat2 << "     Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
if (z == 32 && f == bat - 1 && bat1 > 0) bat1 = bat1- weap;
else if(z == 32 && f == bat + 1 && bat2 > 0) bat2 = bat2 - weap;
else if (gal3 == 1 && f == bat-1 && bat1 > 0) if (As == 0)live--;
else if (gal3 == 1 && f == bat+1 && bat2 > 0) if (As == 0)live--;
if (live == 0) {
bat1 = -10;
bat2 = -10;
}
}
ftl();
per == 2;
sist = 3;
if (bat1 == 0 && bat2 == 0){//Победа над боссом
system("cls");
kred = kred + 50;
cout << "Вы крошите гадов в пыль. Как ни странно, вы даже чувствуете удоволетворение от \n";
cout << "   содеяного. Однако система в безопасности. Пока... Вы заходите на посадку.   \n";
for (int i = 10; i > 0; i--)cout << "\n";
kor();
_getch();
o = o+500;
gal3 = 0;
system("cls");
if (live > 0)Kred();//Магазин на планете
if (live > 0)cout << "Как всегда, вы подлотали судно, подзарядили акумуляторы и получили информацию. \n";   
if (live > 0)cout << "Щупольца матки генерируют какой то... щит. Через него придётся пробиваться. Вы \n";
if (live > 0)cout << " направляетесь дальше. Система Нюрей-зо подверглась нападению давно. Вероятно, \n";
if (live > 0)cout << "                   вас ожидают толпы Жуков. Будте осторожны!                   \n";
if (live > 0)Sist();
}
}
if (sist == 3 && o == 3260){system("cls");//Магазин четвёртой системы
sist++;
cout << "  Хоть пространство и заполонили летучие твари, несколько планет ещё способны  \n";
cout << "оборонятся. Как раз на такую вы смогли приземлится. Информации не много, но она\n";
cout << "очень важна. Щупальца уязвимы для нашего оружия. Уничтожте оба и щит спадёт! Вы\n";
cout << " направляетесь в систему Вега. Опасность максимальна. Пробейтесь через неё и вы\n"; 
cout << "                               доберётесь до матки! \n";
Kred();
Sist();
}
Ast();//Здесь и далее: функция полёта через астероидное поле и орды жуков
if (live < 1){system("cls");//Условия проигрыша и последствия
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
		y = x*2;
while (y>0) {cout << " \n";
		y = y - 1;}
		cout << "       ";
while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "     *^\\ " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << " ^   |-*   ^ " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "*^\\ */*\\\\ /^** " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "*-|*--**-||-* " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "| *|***** ||*| " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "| |* / ** ||** " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "* |*--**||*| " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "*-|*\\*\\*///|*| " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "**_/ *--*| \\*/" << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "    **__**   " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "              " << "\n";
        cout << "       ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "          " << "\n";
cout << "                                  ТЫ ПОГИБ:(";
_getch();
if (Bat == 0) {
system("cls");
	if (o>rec1){cout << "               ВЫ НАБРАЛИ " << o << " ОЧКОВ!!! ЭТО ЛУЧШИЙ РЕЗУЛЬТАТ!!! \n";//Запись в таблицу рекордов
	cout << "                             ВВЕДИТЕ ИМЯ, МАСТЕР: \n";
	cin >> man3;
	rec3 = rec2;
	rec2 = rec1;
	rec1 = o;
switch (tab)
{
case 1: {
ofstream fout("Record1.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 2: {
ofstream fout("Record2.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 3: {
ofstream fout("Record3.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 4: {
ofstream fout("Record4.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
}
switch (tab)
{
case 1: {
ofstream fout2("Mans1.txt", ios_base::trunc);
	fout2 << man3 << " " << man1 << " " << man2;
	fout2.close();
break;
}
case 2: {
ofstream fout2("Mans2.txt", ios_base::trunc);
	fout2 << man3 << " " << man1 << " " << man2;
	fout2.close();
break;
}
case 3: {
ofstream fout2("Mans3.txt", ios_base::trunc);
	fout2 << man3 << " " << man1 << " " << man2;
	fout2.close();
break;
}
case 4: {
ofstream fout2("Mans4.txt", ios_base::trunc);
	fout2 << man3 << " " << man1 << " " << man2;
	fout2.close();
break;
}
}
	system("cls");
cout << "                        ТАБЛИЦА РЕКОРДОВ. НАШЁЛ СЕБЯ? \n";
cout << "                               1. " << man3 << " " << rec1 << " \n";
cout << "                               2. " << man1 << " " << rec2 << " \n";
cout << "                               3. " << man2 << " " << rec3 << " \n";
	}
	else if (o>rec2){cout << "               ВЫ НАБРАЛИ " << o << " ОЧКОВ!!! ПОЧЁТНОЕ ВТОРОЕ МЕСТО!!! \n";
	cout << "                              ВВЕДИТЕ ВАШЕ ИМЯ: \n";
	cin >> man3;
	rec3 = rec2;
	rec2 = o;
switch (tab)
{
case 1: {
ofstream fout("Record1.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 2: {
ofstream fout("Record2.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 3: {
ofstream fout("Record3.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 4: {
ofstream fout("Record4.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
}
switch (tab)
{
case 1: {
ofstream fout2("Mans1.txt", ios_base::trunc);
	fout2 << man1 << " " << man2 << " " << man2;
	fout2.close();
break;
}
case 2: {
ofstream fout2("Mans2.txt", ios_base::trunc);
	fout2 << man1 << " " << man3 << " " << man2;
	fout2.close();
break;
}
case 3: {
ofstream fout2("Mans3.txt", ios_base::trunc);
	fout2 << man1 << " " << man3 << " " << man2;
	fout2.close();
break;
}
case 4: {
ofstream fout2("Mans4.txt", ios_base::trunc);
	fout2 << man1 << " " << man3 << " " << man2;
	fout2.close();
break;
}
}
	system("cls");
cout << "                        ТАБЛИЦА РЕКОРДОВ. НАШЁЛ СЕБЯ? \n";
cout << "                               1. " << man1 << " " << rec1 << " \n";
cout << "                               2. " << man3 << " " << rec2 << " \n";
cout << "                               3. " << man2 << " " << rec3 << " \n";
	}
	else if (o>rec3) {cout << "                  Вы набрали " << o << " очков. Третье место. Тоже неплохо \n";
	cout << "                              Можете ввести имя: \n";
	cin >> man3;
	rec3 = o;
switch (tab)
{
case 1: {
ofstream fout("Record1.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 2: {
ofstream fout("Record2.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 3: {
ofstream fout("Record3.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
case 4: {
ofstream fout("Record4.txt", ios_base::trunc);
	fout << rec1 << " " << rec2 << " " << rec3;
	fout.close();
break;
}
}
switch (tab)
{
case 1: {
ofstream fout2("Mans1.txt", ios_base::trunc);
	fout2 << man1 << " " << man2 << " " << man3;
	fout2.close();
break;
}
case 2: {
ofstream fout2("Mans2.txt", ios_base::trunc);
	fout2 << man1 << " " << man2 << " " << man3;
	fout2.close();
break;
}
case 3: {
ofstream fout2("Mans3.txt", ios_base::trunc);
	fout2 << man1 << " " << man2 << " " << man3;
	fout2.close();
break;
}
case 4: {
ofstream fout2("Mans4.txt", ios_base::trunc);
	fout2 << man1 << " " << man2 << " " << man3;
	fout2.close();
break;
}
}
	system("cls");
cout << "                        ТАБЛИЦА РЕКОРДОВ. НАШЁЛ СЕБЯ? \n";
cout << "                               1. " << man1 << " " << rec1 << " \n";
cout << "                               2. " << man2 << " " << rec2 << " \n";
cout << "                               3. " << man3 << " " << rec3 << " \n";
	}
	else{
cout << "                           Ты набрал " << o << " очков. Лох \n";
_getch();
system("cls");
cout << "                        ТАБЛИЦА РЕКОРДОВ. НАШЁЛ СЕБЯ? \n";
cout << "                               1. " << man1 << " " << rec1 << " \n";
cout << "                               2. " << man2 << " " << rec2 << " \n";
cout << "                               3. " << man3 << " " << rec3 << " \n";
}
}
else {system("cls");
cout << "                      Чудесная игра, милорд!!! Вы были бесподобны!!! \n";}
_getch();
Ent = 0;
system("cls");
while (Ent == 0){
cout << "\n                            Хочешь сыграть ещё? \n";//Меню выхода
if (si == 1) cout << "                                  --> Да <--\n";
else cout << "                                      Да \n";
if (si == 2) cout << "                                 --> Si!! <--\n";
else cout << "                                     Si!! \n";
if (si == 3) cout << "                                --> YES!!! <--\n";
else cout << "                                    YES!!! \n";
if (si == 4) cout << "                                 --> Нет( <--\n";
else cout << "                                     Нет( \n";
tes = _getch();
if(static_cast<int>(tes) == -10 || static_cast<int>(tes) == 119) si--;
else if(static_cast<int>(tes) == -5 || static_cast<int>(tes) == 115) si++;
else if(GetAsyncKeyState(VK_SPACE)) Ent++;
if (si == 5) si--;
if (si == 0) si++;
system("cls");
}
system("cls");
if (si == 4)return 0;
else z =101;}
cout << " Жизни: " << live << "                                                        Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
}
}
return 0;}//Конец программы, начало обьявления функции
void ast(){//Дочерняя функция для функции Ast()
while (k[1]==0 && k[2]==0 && k[3]==0 && k[4]==0 && k[5]==0 || k[1]==1 && k[2]==1 && k[3]==1 && k[4]==1 && k[5]==1){k[1] = rand()%2;
k[2] = rand()%2;
k[3] = rand()%2;
k[4] = rand()%2;
k[5] = rand()%2;}
h = rand()%sh;
dop = rand()%2;
if (h<5)k[h+1] = 3;
if (z == 32){if (k[f] == 1)k[f] = 5;
		else k[f] = 4;
}
cout << "      ";
if (sist != 3 && sist != 4){
for (int j = 1; j < 6; j++)
    if (k[j] == 5) if (weap == 1) cout << " |   **    | ";
    else  cout << " ^   **    ^ ";
    else if (k[j] == 1) cout << "     ***     ";
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    	else cout << " ^         ^ ";
    		else cout << "             ";}
else {for (int j = 1; j < 6; j++)
    if (k[j] == 5) if (weap == 1) cout << " |    _  * | ";
    else cout << " ^    _  * ^ ";
    else if (k[j] == 1) cout << "   |  _  |   ";
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    	else cout << " ^         ^ ";
    		else cout << "             ";}
    cout << " \n";
    cout << "      ";
if (sist != 3 && sist != 4){
for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "    *****    ";
    else if (k[j] == 3 && dop == 1) cout << "      _      ";
    	else if (k[j] == 3) cout << "    /\\/\\     ";
    		else if (k[j] == 5) if (weap == 1) cout << " |    **   | ";
    		else cout << " ^    **   ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
else {for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "  |\\// \\\\/|  ";
    else if (k[j] == 3 && dop == 1) cout << "      _      ";
    	else if (k[j] == 3) cout << "    /\\/\\     ";
    		else if (k[j] == 5) if (weap == 1) cout << " ||*/* \\*/|| ";
    		else cout << " ^|*/* \\*/|^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
    cout << " \n";
    cout << "      ";
if (sist != 3 && sist != 4){for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "   *******   ";
    else if (k[j] == 3 && dop == 1) cout << "     |E|     ";
	    else if (k[j] == 3) cout << "    \\  /     ";
    		else if (k[j] == 5) if (weap == 1) cout << " | * * * * | ";
    		else cout << " ^ * * * * ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
else {for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "   \\|\\ /|/   ";
    else if (k[j] == 3 && dop == 1) cout << "     |E|     ";
	    else if (k[j] == 3) cout << "    \\  /     ";
    		else if (k[j] == 5) if (weap == 1) cout << " | \\*\\ /*/ | ";
    		else cout << " ^ \\*\\ /*/ ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
    cout << " \n";
    cout << "      ";
if (sist != 3 && sist != 4){for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "    *****    ";
    else if (k[j] == 3 && dop == 1) cout << "     |_|     ";
	    else if (k[j] == 3) cout << "     \\/      ";
    		else if (k[j] == 5) if (weap == 1) cout << " |   **    | ";
    		else cout << " ^   **    ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
else {for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "   /\\/ \\/\\   ";
    else if (k[j] == 3 && dop == 1) cout << "     |_|     ";
	    else if (k[j] == 3) cout << "     \\/      ";
    		else if (k[j] == 5) if (weap == 1) cout << " | /** *\\  | ";
    		else cout << " ^ /** *\\  ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    			else cout << " ^         ^ ";
    				else cout << "             ";}
    cout << " \n";
    cout << "      ";
if (sist != 3 && sist != 4){for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "     ***     ";
    else if (k[j] == 5) {kred = kred + 5;
	if (weap == 1) cout << " |   * *   | ";
	else cout << " ^   * *   ^ ";}
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    	else cout << " ^         ^ ";
    		else cout << "             ";}
else {for (int j = 1; j < 6; j++)
    if (k[j] == 1) cout << "   | \\^/ |   ";
    else if (k[j] == 5) {kred = kred + 5;
	if (weap == 1) cout << " | * \\*    | ";
	else cout << " ^ * \\*    ^ ";}
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
    	else cout << " ^         ^ ";
    		else cout << "             ";}
cout << " \n";
if (k[f] == 5 || k[f] == 4)k[f]=0;}
void kor(){//Изображение коробля
r = f;
		l = f-1;
        l = l*13;
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        if (Boss == 0 || pBoss == 0) cout << "     /^\\" << "\n";
        else if (boss == 5 && f == 5) cout << " /  |/^\\\\ || " << "\n";
			else if (boss == 1 && f == 1) cout << " || //^\\|  \\ " << "\n";
				else if(z == 32) if (weap == 1) cout << " |   /^\\   |" << "\n";
				else cout << " ^   /^\\   ^" << "\n";
        			else cout << "     /^\\" << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        if (Boss == 0 || pBoss == 0) cout << " ^   |-|   ^ " << "\n";
        else if (boss == 5 && f == 5) cout << " ^  ||-| \\ ^ " << "\n";
			else if (boss == 1 && f == 1) cout << " ^ / |-||  ^ " << "\n";
				else if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/" << "\n";
				else cout << "\\^/  |-|  \\^/" << "\n";
         	else cout << " ^   |-|   ^ " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "/^\\ //^\\\\ /^\\ " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "|-||-----||-| " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "| || \\^/ || | " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "| || / \\ || | " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "| ||-----|| | " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "|-|\\\\\\^///|-| " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "\\_/ |---| \\_/" << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << " ^  \\___/  ^" << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "/^\\  /^\\  /^\\ " << "\n";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "      ";
        cout << "    /^^^\\ " << "\n";
		c[5] = k[5];
		f = r;
		}
void Kor(){//Вторая функция изображения коробля
	cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f){if (z == 32)if (weap == 1) cout << " |   /^\\   | ";
	else cout << " ^   /^\\   ^ ";
        else if (j == bag && gal == 1) cout << "    |/^\\|    ";
        else if (j == pir && gal2 == 1) cout << "| |  /^\\ | | ";
		else cout << "     /^\\     ";}
		else if (j == bag && gal == 1) cout << "    |   |    ";
		else if (j == pir && gal2 == 1) cout << "| |      | | ";
		else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
        	else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f){if (z == 32)if (weap == 1) cout << "\\|/  |-|  \\|/";
	else cout << "\\^/  |-|  \\^/";
	else if (j == bag && gal == 1)  cout << " ^  ||-||  ^ ";
	else if (j == pir && gal2 == 1)  cout << "|^|  |-| | | ";
		else cout << " ^   |-|   ^ ";
	}
	else if (j == bag && gal == 1) cout << "    |   |    ";
	else if (j == pir && gal2 == 1) cout << "| |      | | ";
	else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    				else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "/^\\ //^\\\\ /^\\";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    			else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "|-||-----||-|";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    			else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "| || \\^/ || |";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "| || / \\ || |";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "| ||-----|| |";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "|-|\\\\\\^///|-|";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "\\_/ |---| \\_/";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << " ^  \\___/  ^ ";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "/^\\  /^\\  /^\\";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
	if (j == f) cout << "    /^^^\\    ";
    else if (j == bag && gal == 1) cout << "    |   |    ";
    else if (j == pir && gal2 == 1) cout << "| |      | | ";
    else if (j == bat - 1 && gal3 == 1 && bat1 != 0 || j == bat + 1 && gal3 == 1 && bat2 != 0) cout << "      |      ";
    else cout << "             ";
    cout << " \n";
}
void time(){//Функция настройки скорости движения и паралельного ввода с клавиатуры
int was_hit = 0;     
clock_t ev = clock();
clock_t new_ev = 0;  
while (1) {
new_ev = clock();
if (o == 2000 || o == 7000) {
if ((new_ev - ev)/(double)CLOCKS_PER_SEC >= t2) {
break;
}
}
else if ((new_ev - ev)/(double)CLOCKS_PER_SEC >= t) {
break;
}
if (kbhit()) {
s = _getch();
was_hit = 1;
break;}}
if (was_hit == 0) s = 'w';
was_hit = 0;
new_ev = 0;
ev = 0;
}
void Kred(){//Работа магазина на планетах
Ent = 0;
u = 1;
kv1 = 0;
kv1 = rand()%2;
kv2 = 0;
kv2 = rand()%2;
while (Ent == 0){//Главное меню
system("cls");
cout << "   Вы сели на самую крупную планету системы. Перед взлётом у вас есть время    \n";
cout << "                   посетить пару магазинов. Куда направимся? \n";
cout << " \n";
cout << " \n";
if (u == 1) cout << "                       -->     Оружейный магазин     <-- \n";
else cout << "                               Оружейный магазин \n";
cout << " \n";
if (u == 2) cout << "                       -->     Рынок с припасами     <-- \n";
else cout << "                               Рынок с припасами \n";
cout << " \n";
if (u == 3) cout << "                       -->        Поиск работы       <-- \n";
else cout << "                                  Поиск работы \n";
cout << " \n";
if (u == 4) cout << "                       -->    Взлететь с планеты     <-- \n";
else cout << "                              Взлететь с планеты \n";
tes = _getch();
if(static_cast<int>(tes) == -10 || static_cast<int>(tes) == 119) u--;
else if(static_cast<int>(tes) == -5 || static_cast<int>(tes) == 115) u++;
else if(GetAsyncKeyState(VK_SPACE)){if (u == 4) Ent++;
else if (u == 1){
Ent2 = 0;
while (Ent2 == 0){//Оружейная лавка
system("cls");
cout << "    Перед вами крупнейший оружейный магазин на планете. Что вас интересует?    \n";
cout << " \n";
cout << "                                Ваше состояние: " << kred << " кредитов \n";
cout << "                              Ваше вооружение: ";
if (weap == 1) cout << "Лазерная турель \n";
else if (weap == 2) cout << "Плазменная ракетница \n";
else cout << "Пушка Гауса \n";
cout << " \n";
cout << "          Лазерная турель     Плазменная ракетница       Пушка Гауса        \n";
cout << "            100 кредитов         300 кредитов           550 кредитов        \n";
cout << "                                                                            \n";
cout << "             _________             __________            /|------\\         \n";
cout << "        ";
if (u == 1) cout << "--> //___/\\___]> <-- ";
else cout << "    //___/\\___]>     ";
if (u == 2) cout << "-->  /_/\\__/\\___> <-- ";
else cout << "     /_/\\__/\\___>     ";
if (u == 3) cout << "-->  /||========== <-- ";
else cout << "     /||==========     ";
cout << " \n";
cout << "           //   /  \\             //_\\/__\\/__>          /|||------/          \n";
cout << " \n";
if (u == 4) cout << "                                 --> Уйти <-- \n";
else cout << "                                     Уйти \n";
tes = _getch();
if(static_cast<int>(tes) == 97 || static_cast<int>(tes) == -12) u--;
else if(static_cast<int>(tes) == 100 || static_cast<int>(tes) == -30) u++;
else if(GetAsyncKeyState(VK_SPACE)){if (u == 4) Ent2++;
else if (u == 1 && weap != 1 && kred > 99) {weap = 1;
kred = kred - 100;
}
else if (u == 2 && weap != 2 && kred > 299) {weap = 2;
kred = kred - 300;
}
else if (u == 3 && weap != 3 && kred > 549) {weap = 3;
kred = kred - 550;
}
}
if (u == 5) u = 1;
if (u == 0) u = 4;
}
u = 1;
}
else if (u == 2){
Ent2 = 0;
while (Ent2 == 0){//Рынок припасов
system("cls");
cout << "    Перед вами крупнейший рынок с припасами на планете. Что вас интересует?    \n";
cout << " \n";
cout << "                                Ваше состояние:";
cout << " \n";
cout << "                                  Кредиты: " << kred << " \n";
cout << "                                   Жизни: " << live << " \n";
cout << "                                  Энергия: " << E << " \n";
cout << "                                  Боеприпасы: " << rok << " \n";
cout << "                                Генираторы щитов: " << gens << " \n";
cout << " \n";
cout << "                Энергия     Боезапас     Ремонт    Гениратор щита\n";
cout << "              25 кредитов 50 кредитов  25 кредитов  100 кредитов \n";
cout << "                                                        ___ \n";
cout << "                   _           ^          /\\/\\         / | \\ \n";
if (u == 1) cout << "              --> |E| <-- ";
else cout << "                  |E|     ";
if (u == 2) cout << "--> |^| <-- ";
else cout << "    |^|     ";
if (u == 3) cout << "--> \\  / <-- ";
else cout << "    \\  /     ";
if (u == 4) cout << "--> |-+-| <-- \n";
else cout << "    |-+-|     \n";
cout << "                  |_|         |^|          \\/          \\_|_/ \n";
cout << " \n";
if (u == 5) cout << "                                 --> Уйти <-- \n";
else cout << "                                     Уйти \n";
tes = _getch();
if(static_cast<int>(tes) == 97 || static_cast<int>(tes) == -12) u--;
else if(static_cast<int>(tes) == 100 || static_cast<int>(tes) == -30) u++;
else if(GetAsyncKeyState(VK_SPACE)){if (u == 5) Ent2++;
else if (u == 1 && kred > 24) {kred = kred - 50;
E = E + 5;
}
else if (u == 2 && kred > 49) {kred = kred - 50;
rok = rok + 5;
}
else if (u == 3 && kred > 24) {kred = kred - 25;
live++;
}
else if (u == 4 && kred > 99) {kred = kred - 100;
gens++;
}
}
if (u == 6) u = 1;
if (u == 0) u = 5;
}
u = 1;
}
else if (u == 3){u = 1;
Ent2 = 0;
while (Ent2 == 0){//Контракты
system("cls");
cout << " Вы просматриваете объявления о найме коробля. Кое что кажется вам интересным: \n";
cout << " \n";
cout << " \n";
if (u == 1) cout << "                       -->    Закончить с поиском    <-- \n";
else cout << "                              Закончить с поиском \n";
cout << " \n";
if (kv1 == 1){if (u == 2) cout << "                       -->    Охота на преступника   <-- \n";
else cout << "                              Охота на преступника \n";
cout << " \n";}
if (kv2 == 1){if (u == 3) cout << "                       -->     Доставка посылки    <-- \n";
else cout << "                               Доставка посылки \n";}
tes = _getch();
if(static_cast<int>(tes) == -10 || static_cast<int>(tes) == 119){u--;
if (kv2 == 1 && kv1 == 0) {if (u == 2) u = 1;}}
else if(static_cast<int>(tes) == -5 || static_cast<int>(tes) == 115){u++;
if (kv2 == 1 && kv1 == 0) {if (u == 2) u = 3;}}
else if(GetAsyncKeyState(VK_SPACE)){if (u == 1) Ent2++;
else if (u == 2) {//Вызов 1-ого контракта
system("cls");
cout << "\n";
cout << "\n";
cout << "\n";
cout << "    Ваш контракт: поймать вора, укравшего новейший сверхсветовой двигатель     \n";
cout << "                     Противник слаб, но быстр и манёвренен                     \n";
cout << "          Сбейте его с пяти выстрелов, чтобы заработать 200 кредитов           \n";
_getch();
gad = 3;
lg = 1;
if (weap == 1||weap == 3){re0 = E;
E = 5;
}
if (weap == 2||weap == 3){re1 = rok;
rok = 5;
}
while (lg > 0 && z != 101){system("cls");
cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
cout << "      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "      ^      ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "     /^\\     ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "   /\\***/\\   ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "  /*|---|*\\  ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " /|*|---|*|\\ ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " ||*|---|*|| ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " ||\\|---|/|| ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " ||/\\___/\\|| ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
if (z != 32){cout << "\n";
cout << "\n";
}
else {for (int i=0; i != f-1; i++)cout << "             ";
if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
cout << "\n      ";
for (int i=0; i != f-1; i++)cout << "             ";
if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
cout << "\n";
}
kor();
cout << " Жизни: " << live << "                        Жизнь врага: " << lg << "                   Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
time();
if (z != 101)z = static_cast<int>(s);
else system("cls");
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                     ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(E!=0 && Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
u++;
if (u > 2) u++;
if (u < 3)gad++;
else gad--;
if (u == 4) u = 0;
if (gad == 6) gad = 1;
if (gad == 0) gad = 5;
if (f == gad && z == 32)lg = lg-weap;
if (weap == 1 && E == 0 || weap == 2 && rok == 0 || weap == 3 && E == 0 && rok == 0) z = 101;
}
system("cls");
if (z != 101){cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
cout << "\n      ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "     *\\     ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "    \\** *\\   ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "  /*|-**|*\\  ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " *  *  -|*|* ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << "  |*|*-   || ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " *|\ -*-|/  |  ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=1; i != 6; i++)if (i == gad)cout << " |*/\   */| | ";
else if (i == f && z == 32 ) if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
else cout << "             ";
cout << "\n      ";
for (int i=0; i != f-1; i++)cout << "             ";
if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
cout << "\n      ";
for (int i=0; i != f-1; i++)cout << "             ";
if (weap == 1)cout << " |         | ";
else cout << " ^         ^ ";
cout << "\n";
kor();
cout << " Жизни: " << live << "                                                         Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
_getch();
system("cls");
cout << "\n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "                 Задание выполнено. Вы возвращаетесь на планету                ";
kred = kred + 200;
u = 1;
_getch();
}
else if (weap == 1 && E == 0 || weap == 2 && rok == 0 || weap == 3 && E == 0 && rok == 0) {cout << "                   Задание провалено. Вы возвращаетесь нисчем                  ";
_getch();}
if (weap == 1||weap == 3)E = re0;
if (weap == 2||weap == 3)rok = re1;
z = 0;
kv1 = 0;
u = 1;
}
else if (u == 3) {//Вызов 2-ого контракта
rr = 0;
c[1] = 0;
c[2] = 0;
c[3] = 0;
c[4] = 0;
k[5] = 0;
k[1] = 0;
k[2] = 0;
k[3] = 0;
k[4] = 0;
system("cls");
cout << "\n";
cout << "\n";
cout << "\n";
cout << "              Ваш контракт: доставить посылку на соседнюю планету              \n";
cout << "                Посылка хрупка, любое столкновение ей повредит                 \n";
cout << "   Наберите 40 очков, не получив повреждений, чтобы заработать 200 кредитов    \n";
_getch();
re0 = live;
live = 1;
re1 = o;
o = 0;
while(o < 41 && live != 0){Ast();
cout << " Жизни: " << live << "                                                        Э/Б/Щ: " << E << "/"<< rok << "/" << gens;
o++;}
system("cls");
if (o == 41){cout << "                 Задание выполнено. Вы возвращаетесь на планету                ";
kred = kred + 200;}
else cout << "                   Задание провалено. Вы возвращаетесь нисчем                  ";
live = re0;
o = re1;
_getch();
kv2 = 0;
u = 1;
}
}
if (kv1 == 1 && kv2 == 1){if (u == 4) u--;}
else if (kv1 == 1 && kv2 == 0) {if (u == 3) u--;}
else if (kv2 == 1 && kv1 == 0) {if (u == 4)u--;}
else u = 1;
if (u == 0) u++;
}
}
}
if (u == 5) u--;
if (u == 0) u++;
}
system("cls");
}
void Sist(){//Функция перехода между системами
if (sist == 3) cout << "                                > () < - - - \n";
else cout << "                                  () - - - - \n";
if (sist == 5) cout << "                                /            \\       - - > () < \n";
else cout << "                                /            \\       - - - () \n";
if (sist == 1) cout << "               > () <         /                \\   / \n";
else cout << "                 ()           /                \\   / \n";
if (sist == 4) cout << "                   \\        /                  > () < \n";
else cout << "                   \\        /                    () \n";
if (sist == 2) cout << "                     - > () < \n";
else cout << "                     - - () \n";
_getch();
E = E+5;
live++;
system("cls");
}
void ftl(){//Функция обыска короблей
u = 1;
Ent = 0;
while (Ent == 0){
system("cls");
cout << "          Среди обломков коробля-противника виднеются ценные ресурсы           \n";
cout << "               Будем марадёрствовать? (корабль может пострадать)               \n";
cout << " \n";
cout << " \n";
if (u == 1) cout << "                       -->     Обчистить корабль     <-- \n";
else cout << "                               Обчистить корабль \n";
cout << " \n";
if (u == 2) cout << "                       -->    Не рисковать судном    <-- \n";
else cout << "                              Не рисковать судном \n";
tes = _getch();
if(static_cast<int>(tes) == -10 || static_cast<int>(tes) == 119) u--;
else if(static_cast<int>(tes) == -5 || static_cast<int>(tes) == 115) u++;
else if(GetAsyncKeyState(VK_SPACE)) Ent++;
if (u == 3) u--;
if (u == 0) u++;
}
if (u == 1) {u = rand()%2;
if (u == 1) {cout << " \n";
cout << " \n";
cout << " \n";
cout << "      Вы смогли добыть 100 кредитов и пару боеприпасов. Но риск был велик      ";
kred = kred + 100;
rok = rok + 2;
_getch();
}
else {cout << " \n";
cout << " \n";
cout << " \n";
cout << "   При вашем приближении корабль развалился. Вас зацепило обломками. -2 жизни  ";
live = live - 2;
_getch();
}
}
}
void Ast(){//Функция полёта через астероиды и прочие препятствия
time();
if (As > 0) As--;
if (z != 101)z = static_cast<int>(s);
else system("cls");
if (z == 97 || z == -12) f = f - 1;
if (z == 100 || z == -30) f = f + 1;
if (z == 99 || z == -15) if (gens > 0){gens--;
As = 5;}
if (z == 113 || z == -23) {cout << "                                     ПАУЗА";
_getch();}
if (f == 0)f=5;
if (f == 6)f=1;
if (z == -13) z = 101;
if (z == 32){if(E!=0 && Bat == 0){ if (E!=0 && weap != 2)E = E-1;
else if (rok != 0 && weap != 1)rok--;
else if (Bat == 0)z = 0;
}
else if (Bat == 0)z = 0;
}
r = f;
Wt = live;
system("cls");
if (o<0)cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: 0 \n"; 
else cout << "Кредитов: " << kred << "                 Время работы щита: " << As << "                Очки: " << o << " \n"; 
if (k[5]==0 && k[1]==0 && k[2]==0 && k[3]==0 && k[4]==0){ast();
y = x+1;
if (z == 32) {while (y>0){while (f>1){cout << "             ";
f = f-1;
}
cout << "      ";
if (weap == 1)cout << " |         | \n";
else cout << " ^         ^ \n";
f = r;
y = y-1;}
}
else while (y>0){cout << " \n";
y = y-1;}
}
else {    y = x+1;
if (z == 32) {while (y>0){while (f>1){cout << "             ";
f = f-1;
}
cout << "      ";
if (weap == 1)cout << " |         | \n";
else cout << " ^         ^ \n";
f = r;
y = y-1;}
}
else while (y>0){cout << " \n";
y = y-1;}

if (z == 32){if (k[f] == 1)k[f] = 5;
		else k[f] = 4;
	}
	cout << "      ";
for (int j = 1; j < 6; j++)
if (sist != 3 && sist != 4){
    if (k[j] == 1) cout << "     ***     ";
    else if (k[j] == 5) if (weap == 1)cout << " |   **    | ";
				   else cout << " ^   **    ^ ";
    	else if (k[j] == 4) if (weap == 1)cout << " |         | ";
									 else cout << " ^         ^ ";
    		else cout << "             ";}
else {if (k[j] == 1) cout << "   |  _  |   ";
    else if (k[j] == 5) if (weap == 1)cout << " |    _  * | ";
				   else cout << " ^    _  * ^ ";
    	else if (k[j] == 4) if (weap == 1)cout << " |         | ";
									 else cout << " ^         ^ ";
    		else cout << "             ";}
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)if (sist != 3 && sist != 4){ if (k[j] == 1) cout << "    *****    ";
    else if (k[j] == 3 && dop == 1) cout << "      _      ";
	    else if (k[j] == 3) cout << "    /\\/\\     ";
    		else if (k[j] == 5) if (weap == 1)cout << " |    **   | ";
				   else cout << " ^    **   ^ ";
    			else if (k[j] == 4) if (weap == 1)cout << " |         | ";
											 else cout << " ^         ^ ";
    				else cout << "             ";}
else{if (k[j] == 1) cout << "  |\\// \\\\/|  ";
    else if (k[j] == 3 && dop == 1) cout << "      _      ";
	    else if (k[j] == 3) cout << "    /\\/\\     ";
    		else if (k[j] == 5) if (weap == 1)cout << " ||*/* \\*/|| ";
    									 else cout << " ^|*/* \\*/|^ ";
    			else if (k[j] == 4) if (weap == 1)cout << " |         | ";
 											 else cout << " ^         ^ ";
    				else cout << "             ";
}
    cout << " \n";
	cout << "      ";
for (int j = 1; j < 6; j++)if (sist != 3 && sist != 4){if (k[j] == 1) cout << "   *******   ";
	    else if (k[j] == 3 && dop == 1) {cout << "     |E|     ";
    dop2 = 2;}
	    else if (k[j] == 3) {cout << "    \\  /     ";
	    dop2 = 1;}
    		else if (k[j] == 5) if (weap == 1) cout << " | * * * * | ";
    							else cout << " ^ * * * * ^ ";
    			else if (k[j] == 4) if (weap == 1)cout << " |         | ";
 							   				 else cout << " ^         ^ ";
    				else cout << "             ";}
else {if (k[j] == 1) cout << "   \\|\\ /|/   ";
	    else if (k[j] == 3 && dop == 1) {cout << "     |E|     ";
    dop2 = 2;}
	    else if (k[j] == 3) {cout << "    \\  /     ";
	    dop2 = 1;}
    		else if (k[j] == 5) if (weap == 1) cout << " | \\*\\ /*/ | ";
    							else cout << " ^ \\*\\ /*/ ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
 							  				  else cout << " ^         ^ ";
    				else cout << "             ";
}
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)if (sist != 3 && sist != 4){if (k[j] == 1) cout << "    *****    ";
    else if (k[j] == 3 && dop == 1) cout << "     |_|     ";
	    else if (k[j] == 3) cout << "     \\/      ";
    		else if (k[j] == 5) if (weap == 1) cout << " |   **    | ";
    						else cout << " ^   **    ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
 							   				  else cout << " ^         ^ ";
    				else cout << "             ";}
else {if (k[j] == 1) cout << "   /\\/ \\/\\   ";
    else if (k[j] == 3 && dop == 1) cout << "     |_|     ";
	    else if (k[j] == 3) cout << "     \\/      ";
    		else if (k[j] == 5) if (weap == 1) cout << " | /** *\\  | ";
    							else cout << " ^ /** *\\  ^ ";
    			else if (k[j] == 4) if (weap == 1) cout << " |         | ";
 							   				  else cout << " ^         ^ ";
    				else cout << "             ";
}
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)if (sist != 3 && sist != 4){if (k[j] == 1) cout << "     ***     ";
    else if (k[j] == 5) {kred = kred + 5;
	if (weap == 1) cout << " |   * *   | ";
	else cout << " ^   * *   ^ ";}
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
 					   				  else cout << " ^         ^ ";
    		else cout << "             ";}
else {if (k[j] == 1) cout << "   | \\^/ |   ";
    else if (k[j] == 5){kred = kred + 5;
	if (weap == 1) cout << " | * \\*    | ";
           	  else cout << " ^ * \\*    ^ ";}
    	else if (k[j] == 4) if (weap == 1) cout << " |         | ";
 					   				  else cout << " ^         ^ ";
    		else cout << "             ";
}
    cout << " \n";
    if (k[f] == 5 || k[f] == 4)k[f]=0;
c[1]=k[1];
c[2]=k[2];
c[3]=k[3];
c[4]=k[4];
rr=k[5];
k[5] = 0;
k[1] = 0;
k[2] = 0;
k[3] = 0;
k[4] = 0;
}
f = r;
if (Boss == 0 || pBoss == 0) kor();
else if (k[1]==1 || k[2]==1 || k[3]==1 || k[4]==1 || k[5]==1){
pz[1] = c[1];
pz[2] = c[2];
pz[3] = c[3];
pz[4] = c[4];
pz[5] = rr;
g = pz[f];
if (g == 3 && dop2 == 2) {E = E+1;	
g=0;}
else if (g == 3){Wt = Wt+1;		
g=0;}
pz[f] = 2;
l = f-1;
        l = l*13;
        cout << "      ";
for (int j = 1; j < 6; j++)
    if (pz[j] == 1) {if (sist != 3 && sist != 4)cout << "     ***     ";
else cout << "   |  _  |   ";}
    else if (pz[j] == 2){
	 if (z == 32) if (weap == 1)cout << " |   /^\\   | ";
	 else cout << " ^   /^\\   ^ ";
		else cout << "     /^\\     ";}
        	else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
    if (pz[j] == 1) {if (sist != 3 && sist != 4)cout << "    *****    ";
else cout << "  |\\// \\\\/|  ";}
    else if (pz[j] == 2){
	 if (z == 32) if (weap == 1) cout << "\\|/  |-|  \\|/";
	 else cout << "\\^/  |-|  \\^/";
		else cout << " ^   |-|   ^ ";}
			else if (pz[j] == 3 && dop2 == 2) cout << "      _      ";
	    		else if (pz[j] == 3) cout << "    /\\/\\     ";
    				else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
    if (pz[j] == 1) {if (sist != 3 && sist != 4)cout << "   *******   ";
else cout << "   \\|\\ /|/   ";}
    else if (pz[j] == 2) cout << "/^\\ //^\\\\ /^\\";
        else if (pz[j] == 3 && dop2 == 2) cout << "     |E|     ";
	    	else if (pz[j] == 3) cout << "    \\  /     ";
    			else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
    if (pz[j] == 1) {if (sist != 3 && sist != 4)cout << "    *****    ";
else cout << "   /\\/ \\/\\   ";}
    else if (pz[j] == 2) cout << "|-||-----||-|";
        else if (pz[j] == 3 && dop2 == 2) cout << "     |_|     ";
	    	else if (pz[j] == 3) cout << "     \\/      ";
    			else cout << "             ";
    cout << " \n";
    cout << "      ";
for (int j = 1; j < 6; j++)
    if (pz[j] == 1) {if (sist != 3 && sist != 4)cout << "     ***     ";
else cout << "   | \\^/ |   ";}
    else if (pz[j] == 2) cout << "| || \\^/ || |";
    else cout << "             ";
    cout << " \n";
    cout << "      ";
        l = f-1;
        l = l*13;
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "| || / \\ || |" << "\n";
cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "| ||-----|| |" << "\n";
        cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "|-|\\\\\\^///|-|" << "\n";
        cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "\\_/ |---| \\_/" << "\n";
        cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << " ^  \\___/  ^" << "\n";
        cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "/^\\  /^\\  /^\\ " << "\n";
        cout << "      ";
        while (l>0){ cout << " ";
        l = l - 1;}
        l = f-1;
        l = l*13;
        cout << "    /^^^\\ " << "\n";
		c[5] = k[5];
        if (z == 32) z == 0;
		f = r;
		pz[f] = g;
}
else kor();
live = Wt;
if (f==5)rrr=rr;
else rrr=0;
if (rrr==1 && k[5]!=0 || rrr==1 && k[1]!=0 || rrr==1 && k[2]!=0 || rrr==1 && k[3]!=0 || rrr==1 && k[4]!=0 || c[f] ==1 && k[5]!=0 || c[f] ==1 && k[1]!=0 || c[f] ==1 && k[2]!=0 || c[f]==1 && k[3]!=0 || c[f]==1 && k[4]!=0) if (As == 0)live = live - 1;
}
